 IDENTIFICATION DIVISION.
 PROGRAM-ID. HELLOWORLD.

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER. RM-COBOL.
 OBJECT-COMPUTER. RM-COBOL.

 DATA DIVISION.
 FILE SECTION.

 PROCEDURE DIVISION.

 MAIN-LOGIC SECTION.
      DISPLAY "Hello world! THIS IS PRESIDENT RODRIGO DUTERTE!! I'll Announce that I will kill all the CRIMINALS IN The PHILIPPINES "
 STOP RUN.

