	 IDENTIFICATION DIVISION.
	 PROGRAM-ID. CONDITIONALS.
	 ENVIRONMENT DIVISION.
	 DATA DIVISION.
	 WORKING-STORAGE SECTION.
	 01 XNUM1 PIC 9(3).
	 01 XNUM2 PIC 9(3).
	 01 XNUM3 PIC 9(3).
	 01 XNUM4 PIC 9(4).
	 01 XNUM5 PIC 9(4).
	 PROCEDURE DIVISION.
	 EVALUATE-RTN.
		DISPLAY ERASE.
		DISPLAY "ENTER NUM-1 :" LINE 5 COL 5.
		DISPLAY "ENTER NUM-2 :" LINE 6 COL 5.
		DISPLAY "ENTER NUM-3 :" LINE 7 COL 5.
		ACCEPT XNUM1 LINE 5 COL 19.
		ACCEPT XNUM2 LINE 6 COL 19.
		ACCEPT XNUM3 LINE 7 COL 19.	
		
		
		
	
*       GETTING THE HIGHEST NUMBER
		IF XNUM1 > XNUM2 AND XNUM1 > XNUM3
		    DISPLAY"HIGHEST NUMBER" LINE 8 COL 5
			DISPLAY XNUM1  LINE 9 COL 6
		ELSE IF XNUM2 > XNUM1 AND XNUM2 > XNUM3
		    DISPLAY"HIGHEST NUMBER" LINE 8 COL 5
			DISPLAY XNUM2 LINE 9 COL 6
		ELSE IF XNUM3 > XNUM1 AND XNUM3 > XNUM2
		    DISPLAY"HIGHEST NUMBER"LINE 8 COL 5
			DISPLAY XNUM3 LINE 9 COL 6.
*        
			
*			GETTING THE LOWEST NUMBER 
		IF XNUM1 < XNUM2 AND XNUM1 < XNUM3
		    DISPLAY"LOWEST NUMBER" LINE 10 COL 5
			DISPLAY XNUM1  LINE 11 COL 6
		ELSE IF XNUM2 < XNUM1 AND XNUM2 < XNUM3
		    DISPLAY"LOWEST NUMBER" LINE 10 COL 5
			DISPLAY XNUM2 LINE 11 COL 6
		ELSE IF XNUM3 < XNUM1 AND XNUM3 < XNUM2
		    DISPLAY"LOWEST NUMBER" LINE 10 COL 5
			DISPLAY XNUM3 LINE 11 COL 6.
*       CHECK FOR CLASS
      IF XNUM3 IS NUMERIC
         DISPLAY" XNUM3 IS NUMERIC" LINE 12 COL 5.
*       COMPOUND CONDITION
      IF XNUM3 > 499 AND <1000
       	DISPLAY "XNUM3 BETWEEN 499 AND 1000" LINE 12 COL 5.
       	DISPLAY "" LINE 13 COL 5.
      
      
*          GETTING AVERAGE OF 3 NUMBERS WITH ROUNDING OFF
	    Compute XNUM4 rounded = (XNUM1 + XNUM2 + XNUM3)/3.
	     DISPLAY "THE AVERAGE OF THE 3 NUMBERS" LINE 14 COL 5.
		 DISPLAY	XNUM4 LINE 15 COL 5.
		 DISPLAY "" LINE 16 COL 5				
			

			
     STOP RUN.
